In [24]:
import pandas as pd
import numpy as np
df=pd.read_csv("D:/05_DATA CLEANING AND PREPROCESSING/bonus dataset.csv")

In [25]:
print(df)

    First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
0      Douglas    Male    8/6/1993        12:42 PM   97308    6.945
1       Thomas    Male   3/31/1996         6:53 AM   61933    4.170
2        Maria  Female   4/23/1993        11:17 AM  130590   11.858
3        Jerry    Male    3/4/2005         1:00 PM  138705    9.340
4        Larry    Male   1/24/1998         4:47 PM  101004    1.389
..         ...     ...         ...             ...     ...      ...
995      Henry     NaN  11/23/2014         6:09 AM  132483   16.655
996    Phillip    Male   1/31/1984         6:30 AM   42392   19.675
997    Russell    Male   5/20/2013        12:39 PM   96914    1.421
998      Larry    Male   4/20/2013         4:45 PM   60500   11.985
999     Albert    Male   5/15/2012         6:24 PM  129949   10.169

    Senior Management                  Team
0                True             Marketing
1                True                   NaN
2               False               Finance
3                True               Finance
4                True       Client Services
..                ...                   ...
995             False          Distribution
996             False               Finance
997             False               Product
998             False  Business Development
999              True                 Sales

[1000 rows x 8 columns]

In [30]:
df.loc[(df["Bonus %"])>0, "getbonus"]="no bonus"
df.loc[(df["Bonus %"])<35, "getbonus"]="yes bonus"
print(df.head(10))

  First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
0    Douglas    Male    8/6/1993        12:42 PM   97308    6.945
1     Thomas    Male   3/31/1996         6:53 AM   61933    4.170
2      Maria  Female   4/23/1993        11:17 AM  130590   11.858
3      Jerry    Male    3/4/2005         1:00 PM  138705    9.340
4      Larry    Male   1/24/1998         4:47 PM  101004    1.389
5     Dennis    Male   4/18/1987         1:35 AM  115163   10.125
6       Ruby  Female   8/17/1987         4:20 PM   65476   10.012
7        NaN  Female   7/20/2015        10:43 AM   45906   11.598
8     Angela  Female  11/22/2005         6:29 AM   95570   18.523
9    Frances  Female    8/8/2002         6:51 AM  139852    7.524

  Senior Management                  Team   getbonus
0              True             Marketing  yes bonus
1              True                   NaN  yes bonus
2             False               Finance  yes bonus
3              True               Finance  yes bonus
4              True       Client Services  yes bonus
5             False                 Legal  yes bonus
6              True               Product  yes bonus
7               NaN               Finance  yes bonus
8              True           Engineering  yes bonus
9              True  Business Development  yes bonus

In [1]:
import pandas as pd
import numpy as np
data=pd.read_csv("D:/05_DATA CLEANING AND PREPROCESSING/eMPLYOEE RAW.csv")

In [2]:
print(data.head(10))

   Education  JoiningYear       City  PaymentTier  Age  Gender EverBenched  \
0  Bachelors         2017  Bangalore            3   34    Male          No
1  Bachelors         2013       Pune            1   28  Female          No
2  Bachelors         2014  New Delhi            3   38  Female          No
3    Masters         2016  Bangalore            3   27    Male          No
4    Masters         2017       Pune            3   24    Male         Yes
5  Bachelors         2016  Bangalore            3   22    Male          No
6  Bachelors         2015  New Delhi            3   38    Male          No
7  Bachelors         2016  Bangalore            3   34  Female          No
8  Bachelors         2016       Pune            3   23    Male          No
9    Masters         2017  New Delhi            2   37    Male          No

   ExperienceInCurrentDomain  LeaveOrNot
0                          0           0
1                          3           1
2                          2           0
3                          5           1
4                          2           1
5                          0           0
6                          0           0
7                          2           1
8                          1           0
9                          2           0

In [6]:
data["EDU-age"]=data["Education"]+" "+data["Gender"]
print(data)

      Education  JoiningYear       City  PaymentTier  Age  Gender EverBenched  \
0     Bachelors         2017  Bangalore            3   34    Male          No
1     Bachelors         2013       Pune            1   28  Female          No
2     Bachelors         2014  New Delhi            3   38  Female          No
3       Masters         2016  Bangalore            3   27    Male          No
4       Masters         2017       Pune            3   24    Male         Yes
...         ...          ...        ...          ...  ...     ...         ...
4648  Bachelors         2013  Bangalore            3   26  Female          No
4649    Masters         2013       Pune            2   37    Male          No
4650    Masters         2018  New Delhi            3   27    Male          No
4651  Bachelors         2012  Bangalore            3   30    Male         Yes
4652  Bachelors         2015  Bangalore            3   33    Male         Yes

      ExperienceInCurrentDomain  LeaveOrNot           EDU-age
0                             0           0    Bachelors Male
1                             3           1  Bachelors Female
2                             2           0  Bachelors Female
3                             5           1      Masters Male
4                             2           1      Masters Male
...                         ...         ...               ...
4648                          4           0  Bachelors Female
4649                          2           1      Masters Male
4650                          5           1      Masters Male
4651                          2           0    Bachelors Male
4652                          4           0    Bachelors Male

[4653 rows x 10 columns]

In [10]:


data["EDU-age"]=data["Education"].str.lower()+" "+data["Gender"].str.capitalize()
print(data)

      Education  JoiningYear       City  PaymentTier  Age  Gender EverBenched  \
0     Bachelors         2017  Bangalore            3   34    Male          No
1     Bachelors         2013       Pune            1   28  Female          No
2     Bachelors         2014  New Delhi            3   38  Female          No
3       Masters         2016  Bangalore            3   27    Male          No
4       Masters         2017       Pune            3   24    Male         Yes
...         ...          ...        ...          ...  ...     ...         ...
4648  Bachelors         2013  Bangalore            3   26  Female          No
4649    Masters         2013       Pune            2   37    Male          No
4650    Masters         2018  New Delhi            3   27    Male          No
4651  Bachelors         2012  Bangalore            3   30    Male         Yes
4652  Bachelors         2015  Bangalore            3   33    Male         Yes

      ExperienceInCurrentDomain  LeaveOrNot           EDU-age
0                             0           0    bachelors Male
1                             3           1  bachelors Female
2                             2           0  bachelors Female
3                             5           1      masters Male
4                             2           1      masters Male
...                         ...         ...               ...
4648                          4           0  bachelors Female
4649                          2           1      masters Male
4650                          5           1      masters Male
4651                          2           0    bachelors Male
4652                          4           0    bachelors Male

[4653 rows x 10 columns]

In [17]:
import pandas as pd
import numpy as np
data=pd.read_csv("D:/05_DATA CLEANING AND PREPROCESSING/Employee_Salary_Dataset.csv")
print(data.head(10))

   ID  Experience_Years  Age  Gender   Salary
0   1                 5   28  Female   250000
1   2                 1   21    Male    50000
2   3                 3   23  Female   170000
3   4                 2   22    Male    25000
4   5                 1   17    Male    10000
5   6                25   62    Male  5001000
6   7                19   54  Female   800000
7   8                 2   21  Female     9000
8   9                10   36  Female    61500
9  10                15   54  Female   650000

In [18]:
print(data.head(10))

data["Bonus"]=(data["Salary"]/100)*20
print(data.head(10))

   ID  Experience_Years  Age  Gender   Salary
0   1                 5   28  Female   250000
1   2                 1   21    Male    50000
2   3                 3   23  Female   170000
3   4                 2   22    Male    25000
4   5                 1   17    Male    10000
5   6                25   62    Male  5001000
6   7                19   54  Female   800000
7   8                 2   21  Female     9000
8   9                10   36  Female    61500
9  10                15   54  Female   650000
   ID  Experience_Years  Age  Gender   Salary      Bonus
0   1                 5   28  Female   250000    50000.0
1   2                 1   21    Male    50000    10000.0
2   3                 3   23  Female   170000    34000.0
3   4                 2   22    Male    25000     5000.0
4   5                 1   17    Male    10000     2000.0
5   6                25   62    Male  5001000  1000200.0
6   7                19   54  Female   800000   160000.0
7   8                 2   21  Female     9000     1800.0
8   9                10   36  Female    61500    12300.0
9  10                15   54  Female   650000   130000.0

### map shorts mmonths

### prcatice

In [25]:
data={"Months":["janaury","february","March","April"]}


a=pd.DataFrame(data)
print(a)

def extract(value):
    return value[0:3]


a["Short_months"]= a["Months"].map(extract)
print(a)

     Months
0   janaury
1  february
2     March
3     April
     Months Short_months
0   janaury          jan
1  february          feb
2     March          Mar
3     April          Apr